In [1]:
import sqlite3
import pandas as pd

In [2]:
def db_interact(query):
    return pd.read_sql_query(query,db)

In [3]:
db = sqlite3.connect('data/hubway.db')

## SELECT PART 2

In [4]:
query = """
SELECT COUNT(*)
FROM trips
"""

In [5]:
db_interact(query)

   COUNT(*)
0   1570001

In [17]:
query = """
SELECT DISTINCT(bike_number)
FROM trips
WHERE start_station = 42 and end_station = 42
LIMIT 10
"""

In [18]:
db_interact(query)

  bike_number
0      B00042
1      B00385
2      B00040
3      B00139
4      B00514
5      B00484
6      B00450
7      B00419
8      B00543
9      B00113

In [19]:
query = """
SELECT AVG(duration)
FROM trips
WHERE start_station = 42 and end_station = 42
LIMIT 10
"""

In [20]:
db_interact(query)

   AVG(duration)
0     2871.91632